Revit 2027 API
Stone.StoneBump Property
 The property labeled "Type" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StoneBump { get; }
Public Shared ReadOnly Property StoneBump As String
	Get
public:
static property String^ StoneBump {
	String^ get ();
}
static member StoneBump : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneBumpType".
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace